OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Utilities/misc/stm32_tiny_sscanf.c
/******************************************************************************
 * @file    stm32_tiny_sscanf.c
 * @author  MCD Application Team
 * @brief   Tiny implementation of sscanf
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the 
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */


/*
 * This code is derived from
 *     https://github.com/rapid7/metasploit-payloads/, in c/meterpreter/source/bionic/libc/stdio/sscanf.c
 * It has been derived in order to optimize code size. In this context
 * all the formats are not supported. Current supported formats are
 *    %hx, %hhx, %ul, %d,...
 * when TINY_SSCANF is defined
 *
 * When TINY_NO_OX is defined, this is not possible to sscanf("%x") of "0xab",
 * only "ab" is possible
 *
 * When TINY_SPACE_NOT_SPECIALCASE is defined, "space" is not a special character.
 * That means that we expect a single space, and not any of ispace() character
 * (space, tabs,...)
 */
 
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <stdint.h>
#include <stdlib.h>
#include <inttypes.h>
#include "stm32_tiny_sscanf.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define TINY_SSCANF
#define TINY_NO_OX
#define TINY_SPACE_NOT_SPECIALCASE

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Functions Definition ------------------------------------------------------*/

#ifdef FLOATING_POINT
#include "floatio.h"
#endif

#define  BUF    513  /* Maximum length of numeric string. */

/*
 * Flags used during conversion.
 */
#define  LONG    0x00001  /* l: long or double */
#define  SHORT    0x00004  /* h: short */
#define  SHORTSHORT  0x00008  /* hh: 8 bit integer */
#define  UNSIGNED  0x00800  /* %[oupxX] conversions */
#ifdef TINY_SSCANF
#else
#define  LONGDBL    0x00002  /* L: long double; unimplemented */
#define LLONG      0x00010  /* ll: long long (+ deprecated q: quad) */
#define  POINTER    0x00020  /* p: void * (as hex) */
#define  SIZEINT    0x00040  /* z: (signed) size_t */
#define  MAXINT    0x00080  /* j: intmax_t */
#define  PTRINT    0x00100  /* t: ptrdiff_t */
#define  NOSKIP    0x00200  /* [ or c: do not skip blanks */
#define  SUPPRESS  0x00400  /* *: suppress assignment */
#endif

/*
 * The following are used in numeric conversions only:
 * SIGNOK, HAVESIGN, NDIGITS, DPTOK, and EXPOK are for floating point;
 * SIGNOK, HAVESIGN, NDIGITS, PFXOK, and NZDIGITS are for integral.
 */
#define  SIGNOK    0x01000  /* +/- is (still) legal */
#define  HAVESIGN  0x02000  /* sign detected */
#define  NDIGITS    0x04000  /* no digits detected */

#define  DPTOK    0x08000  /* (float) decimal point is still legal */
#define  EXPOK    0x10000  /* (float) exponent (e+3, etc) still legal */

#ifdef TINY_NO_OX
#else
#define  PFXOK    0x08000  /* 0x prefix is (still) legal */
#define  NZDIGITS  0x10000  /* no zero digits detected */
#endif

/*
 * Conversion types.
 */
#define  CT_INT    3  /* integer, i.e., strtoimax or strtoumax */
#define  CT_FLOAT  4  /* floating, i.e., strtod */

#ifdef TINY_SSCANF
#else
#define  CT_CHAR    0  /* %c conversion */
#define  CT_CCL    1  /* %[...] conversion */
#define  CT_STRING  2  /* %s conversion */
#endif

#define u_char unsigned char
#define u_long unsigned long

#ifdef TINY_SSCANF
#else
static u_char *__sccl(char *, u_char *);
#endif

#define VFSCANF tiny_vfscanf

#if !defined(VFSCANF)
#define VFSCANF  vfscanf
#endif


#define __srefill(_x) 1
#define ungetc(_c, _fp) do { (_c), fp_p--; fp_r++; } while (0)
  
/*
 * vfscanf
 */
static inline int
VFSCANF(const char *str, const char *fmt0, __Va_list ap)
{
  u_char *fmt = (u_char *)fmt0;
  int c;    /* character from format, or conversion */
  size_t width;  /* field width, or 0 */
  char *p;  /* points into all kinds of strings */
  int flags;  /* flags as defined above */
  int nassigned;    /* number of fields assigned */
  int nread;    /* number of characters consumed from fp */
  int base;    /* base argument to strtoimax/strtouimax */
  char buf[BUF];    /* buffer for numeric conversions */
  const char *fp_p;
  int fp_r;
  uintmax_t value;
  int sign_minus;


#ifdef TINY_SSCANF
#else
  int n;    /* handy integer */
  char *p0;  /* saves original value of p when necessary */
  char ccltab[256];  /* character class table for %[...] */
#endif
  
  /* `basefix' is used to avoid `if' tests in the integer scanner */
#ifdef TINY_SSCANF
  /* basefix[] can be removed as we do not support %i */
#else  
  static short basefix[17] =
    { 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 };
#endif
    
   fp_p = str;
  fp_r = strlen(str);

  nassigned = 0;
  nread = 0;
  base = 0;    /* XXX just to keep gcc happy */
  for (;;) {
    c = *fmt++;
    if (c == 0)
      return (nassigned);
#ifdef TINY_SPACE_NOT_SPECIALCASE
#else
    if (isspace(c)) {
      while ((fp_r > 0 || __srefill(fp) == 0) &&
          isspace(*fp_p))
        nread++, fp_r--, fp_p++;
      continue;
    }
#endif
    if (c != '%')
      goto literal;
    width = 0;
    flags = 0;
    /*
     * switch on the format.  continue if done;
     * break once format type is derived.
     */
again:    c = *fmt++;
    switch (c) {
    case '%':
literal:
      if (fp_r <= 0 && __srefill(fp))
        goto input_failure;
      if (*fp_p != c)
        goto match_failure;
      fp_r--, fp_p++;
      nread++;
      continue;

#ifdef TINY_SSCANF
#else
    case '*':
      flags |= SUPPRESS;
      goto again;
    case 'j':
      flags |= MAXINT;
      goto again;
    case 'L':
      flags |= LONGDBL;
      goto again;
#endif
    case 'h':
      if (*fmt == 'h') {
        fmt++;
        flags |= SHORTSHORT;
      } else {
        flags |= SHORT;
      }
      goto again;
    case 'l':
#ifdef TINY_SSCANF
      /* %ll not supported */
      flags |= LONG;
      goto again;
#else
      if (*fmt == 'l') {
        fmt++;
        flags |= LLONG;
      } else {
        flags |= LONG;
      }
      goto again;
#endif

#ifdef TINY_SSCANF
#else
    case 'q':
      flags |= LLONG;    /* deprecated */
      goto again;
    case 't':
      flags |= PTRINT;
      goto again;
    case 'z':
      flags |= SIZEINT;
      goto again;
#endif
    case '0': case '1': case '2': case '3': case '4':
    case '5': case '6': case '7': case '8': case '9':
      width = width * 10 + c - '0';
      goto again;

