OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Utilities/misc/stm32_tiny_sscanf.c
    /*
     * Conversions.
     * Those marked `compat' are for 4.[123]BSD compatibility.
     *
     * (According to ANSI, E and X formats are supposed
     * to the same as e and x.  Sorry about that.)
     */
    case 'D':  /* compat */
      flags |= LONG;
      /* FALLTHROUGH */
    case 'd':
      c = CT_INT;
      base = 10;
      break;

#ifdef TINY_SSCANF
    /*
     * We do not support %i to remove potential base=8 in the following
     * Hence basefix can be removed
     */
#else
    case 'i':
      c = CT_INT;
      base = 0;
      break;
#endif
    
#ifdef TINY_SSCANF
#else
    case 'O':  /* compat */
      flags |= LONG;
      /* FALLTHROUGH */
    case 'o':
      c = CT_INT;
      flags |= UNSIGNED;
      base = 8;
      break;
#endif
    
    case 'u':
      c = CT_INT;
      flags |= UNSIGNED;
      base = 10;
      break;

    case 'X':
    case 'x':
#ifdef TINY_NO_OX 
#else
      flags |= PFXOK;  /* enable 0x prefixing */
#endif
      c = CT_INT;
      flags |= UNSIGNED;
      base = 16;
      break;

#ifdef FLOATING_POINT
    case 'E':
    case 'G':
    case 'e': 
    case 'f': 
    case 'g':
      c = CT_FLOAT;
      break;
#endif

#ifdef TINY_SSCANF
#else
    case 's':
      c = CT_STRING;
      break;

    case '[':
      fmt = __sccl(ccltab, fmt);
      flags |= NOSKIP;
      c = CT_CCL;
      break;

    case 'c':
      flags |= NOSKIP;
      c = CT_CHAR;
      break;

    case 'p':  /* pointer format is like hex */
      flags |= POINTER | PFXOK;
      c = CT_INT;
      flags |= UNSIGNED;
      base = 16;
      break;

    case 'n':
      if (flags & SUPPRESS)
        continue;
      if (flags & SHORTSHORT)
        *va_arg(ap, char *) = nread;
      else if (flags & SHORT)
        *va_arg(ap, short *) = nread;
      else if (flags & LONG)
        *va_arg(ap, long *) = nread;
      else if (flags & SIZEINT)
        *va_arg(ap, size_t *) = nread;
      else if (flags & PTRINT)
        *va_arg(ap, ptrdiff_t *) = nread;
      else if (flags & LLONG)
        *va_arg(ap, long long *) = nread;
      else if (flags & MAXINT)
        *va_arg(ap, intmax_t *) = nread;
      else
        *va_arg(ap, int *) = nread;
      continue;
#endif

    /*
     * Disgusting backwards compatibility hacks.  XXX
     */
    case '\0':  /* compat */
      return (EOF);

    default:  /* compat */
#ifdef TINY_SSCANF
#else
      if (isupper(c))
        flags |= LONG;
      c = CT_INT;
      base = 10;
#endif
      break;
    }

    /*
     * We have a conversion that requires input.
     */
    if (fp_r <= 0 && __srefill(fp))
      goto input_failure;

    
    /*
     * Consume leading white space, except for formats
     * that suppress this.
     */
#ifdef TINY_SSCANF
#else
    if ((flags & NOSKIP) == 0) {
      while (isspace(*fp_p)) {
        nread++;
        if (--fp_r > 0)
          fp_p++;
        else if (__srefill(fp))
          goto input_failure;
      }
      /*
       * Note that there is at least one character in
       * the buffer, so conversions that do not set NOSKIP
       * ca no longer result in an input failure.
       */
    }
#endif
    
    /*
     * Do the conversion.
     */
    switch (c) {
#ifdef TINY_SSCANF
#else
    case CT_CHAR:
      /* scan arbitrary characters (sets NOSKIP) */
      if (width == 0)
        width = 1;
      if (flags & SUPPRESS) {
        size_t sum = 0;
        for (;;) {
          if ((n = fp_r) < (int)width) {
            sum += n;
            width -= n;
            fp_p += n;
            if (__srefill(fp)) {
              if (sum == 0)
                  goto input_failure;
              break;
            }
          } else {
            sum += width;
            fp_r -= width;
            fp_p += width;
            break;
          }
        }
        nread += sum;
      } else {
        size_t r = fread((void *)va_arg(ap, char *), 1,
            width, fp);

        if (r == 0)
          goto input_failure;
        nread += r;
        nassigned++;
      }
      break;
#endif
      
#ifdef TINY_SSCANF
#else
    case CT_CCL:
      /* scan a (nonempty) character class (sets NOSKIP) */
      if (width == 0)
        width = (size_t)~0;  /* `infinity' */
      /* take only those things in the class */
      if (flags & SUPPRESS) {
        n = 0;
        while (ccltab[*fp_p]) {
          n++, fp_r--, fp_p++;
          if (--width == 0)
            break;
          if (fp_r <= 0 && __srefill(fp)) {
            if (n == 0)
              goto input_failure;
            break;
          }
        }
        if (n == 0)
          goto match_failure;
      } else {
        p0 = p = va_arg(ap, char *);
        while (ccltab[*fp_p]) {
          fp_r--;
          *p++ = *fp_p++;
          if (--width == 0)
            break;
          if (fp_r <= 0 && __srefill(fp)) {
            if (p == p0)
              goto input_failure;
            break;
          }
        }
        n = p - p0;
        if (n == 0)
          goto match_failure;
        *p = '\0';
        nassigned++;
      }
      nread += n;
      break;
#endif
      
#ifdef TINY_SSCANF
#else
    case CT_STRING:
      /* like CCL, but zero-length string OK, & no NOSKIP */
      if (width == 0)
        width = (size_t)~0;
      if (flags & SUPPRESS) {
        n = 0;
        while (!isspace(*fp_p)) {
          n++, fp_r--, fp_p++;
          if (--width == 0)
            break;
          if (fp_r <= 0 && __srefill(fp))
            break;
        }
        nread += n;
      } else {
        p0 = p = va_arg(ap, char *);
        while (!isspace(*fp_p)) {
          fp_r--;
          *p++ = *fp_p++;
          if (--width == 0)
            break;
          if (fp_r <= 0 && __srefill(fp))
            break;
        }
        *p = '\0';
        nread += p - p0;
        nassigned++;
      }
      continue;
#endif
      
    case CT_INT:
      /* scan an integer as if by strtoimax/strtoumax */
#ifdef hardway
      if (width == 0 || width > sizeof(buf) - 1)
        width = sizeof(buf) - 1;
#else
      /* size_t is unsigned, hence this optimisation */
      if (--width > sizeof(buf) - 2)
        width = sizeof(buf) - 2;
      width++;
#endif

#ifdef TINY_NO_OX
      flags |= SIGNOK | NDIGITS;
#else
      flags |= SIGNOK | NDIGITS | NZDIGITS;
#endif
      
      sign_minus = 0;
      value = 0;
      for (p = buf; width; width--) {
        c = *fp_p;
        /*
         * Switch on the character; `goto ok'
         * if we accept it as a part of number.
         */
        switch (c) {

