OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Utilities/misc/stm32_tiny_sscanf.c
        /*
         * The digit 0 is always legal, but is
         * special.  For %i conversions, if no
         * digits (zero or nonzero) have been
         * scanned (only signs), we will have
         * base==0.  In that case, we should set
         * it to 8 and enable 0x prefixing.
         * Also, if we have not scanned zero digits
         * before this, do not turn off prefixing
         * (someone else will turn it off if we
         * have scanned any nonzero digits).
         */
        case '0':
#ifdef TINY_NO_OX 
          /* FALLTHROUGH */
#else        
#ifdef TINY_SSCANF
#else
          if (base == 0) {
            base = 8;
            flags |= PFXOK;
          }
#endif 
          if (!(flags & NDIGITS)) {
            value = value * base;
          }
          
          if (flags & NZDIGITS)
              flags &= ~(SIGNOK|NZDIGITS|NDIGITS);
          else
              flags &= ~(SIGNOK|PFXOK|NDIGITS);
          goto ok;
#endif
          
#ifdef TINY_SSCANF
        /* we only support base 10 and 16 */
        case '1': case '2': case '3':
        case '4': case '5': case '6': case '7':
        case '8': case '9':
#ifdef TINY_NO_OX 
          flags &= ~(SIGNOK | NDIGITS);
#else
          flags &= ~(SIGNOK | PFXOK | NDIGITS);
#endif
          value = value * base + c - '0';
          goto ok;
#else
        /* 1 through 7 always legal */
        case '1': case '2': case '3':
        case '4': case '5': case '6': case '7':
          base = basefix[base];
          flags &= ~(SIGNOK | PFXOK | NDIGITS);
          value = value * base + c - '0';
          goto ok;

        /* digits 8 and 9 ok iff decimal or hex */
        case '8': case '9':
          base = basefix[base];
          if (base <= 8)
            break;  /* not legal here */
          flags &= ~(SIGNOK | PFXOK | NDIGITS);
          value = value * base + c - '0';
          goto ok;
#endif
          
        /* letters ok iff hex */
        case 'A': case 'B': case 'C':
        case 'D': case 'E': case 'F':
          /* no need to fix base here */
          if (base <= 10)
            break;  /* not legal here */
#ifdef TINY_NO_OX 
          flags &= ~(SIGNOK | NDIGITS);
#else
          flags &= ~(SIGNOK | PFXOK | NDIGITS);
#endif
          value = value * base + c - 'A' + 10;
          goto ok;          
        
        case 'a': case 'b': case 'c':
        case 'd': case 'e': case 'f':
          /* no need to fix base here */
          if (base <= 10)
            break;  /* not legal here */
#ifdef TINY_NO_OX 
          flags &= ~(SIGNOK | NDIGITS);
#else
          flags &= ~(SIGNOK | PFXOK | NDIGITS);
#endif
          value = value * base + c - 'a' + 10;
          goto ok;

        /* sign ok only as first character */
        case '-':
          if (!(flags & HAVESIGN)) {
            sign_minus = 1;
          }
          /* FALLTHROUGH */
        case '+':
          if (flags & SIGNOK) {
            flags &= ~SIGNOK;
            flags |= HAVESIGN;
            goto ok;
          }
          break;

        /*
         * x ok iff flag still set and 2nd char (or
         * 3rd char if we have a sign).
         */
#ifdef TINY_NO_OX
#else
        case 'x': case 'X':
          if ((flags & PFXOK) && p ==
              buf + 1 + !!(flags & HAVESIGN)) {
            base = 16;  /* if %i */
            flags &= ~PFXOK;
            goto ok;
          }
          break;
#endif
        }

        /*
         * If we got here, c is not a legal character
         * for a number.  Stop accumulating digits.
         */
        break;
    ok:
        /*
         * c is legal: store it and look at the next.
         */
        *p++ = c;
        if (--fp_r > 0)
          fp_p++;
        else if (__srefill(fp))
          break;    /* EOF */
      }
      /*
       * If we had only a sign, it is no good; push
       * back the sign.  If the number ends in `x',
       * it was [sign] '0' 'x', so push back the x
       * and treat it as [sign] '0'.
       */
      if (flags & NDIGITS) {
        if (p > buf)
        {
          --c;
          --p;
          ungetc(c++, fp);
          /* There is a dummy post-increment to 
             avoid an unused value warning */
        }
        goto match_failure;
      }
#ifdef TINY_NO_OX 
#else
      c = ((u_char *)p)[-1];
      if (c == 'x' || c == 'X') {
        --p;
        ungetc(c, fp);
      }
#endif
      
#ifdef TINY_SSCANF
      {
#else
      if ((flags & SUPPRESS) == 0) {
#endif

        *p = '\0';
        if (sign_minus)
          value = -value;

#ifdef TINY_SSCANF
#else
        if (flags & POINTER)
          *va_arg(ap, void **) =
              (void *)(uintptr_t)value;
        else if (flags & MAXINT)
          *va_arg(ap, intmax_t *) = value;
        else if (flags & LLONG)
          *va_arg(ap, long long *) = value;
        else if (flags & SIZEINT)
          *va_arg(ap, size_t *) = value;
        else if (flags & PTRINT)
          *va_arg(ap, ptrdiff_t *) = value;
        else 
#endif
        if (flags & LONG)
          *va_arg(ap, long *) = value;
        else if (flags & SHORT)
          *va_arg(ap, short *) = value;
        else if (flags & SHORTSHORT)
          *va_arg(ap, char *) = value;
        else
          *va_arg(ap, int *) = value;
        nassigned++;
      }
      nread += p - buf;
      break;

#ifdef FLOATING_POINT
    case CT_FLOAT:
      /* scan a floating point number as if by strtod */
#ifdef hardway
      if (width == 0 || width > sizeof(buf) - 1)
        width = sizeof(buf) - 1;
#else
      /* size_t is unsigned, hence this optimisation */
      if (--width > sizeof(buf) - 2)
        width = sizeof(buf) - 2;
      width++;
#endif
      flags |= SIGNOK | NDIGITS | DPTOK | EXPOK;
      for (p = buf; width; width--) {
        c = *fp->_p;
        /*
         * This code mimicks the integer conversion
         * code, but is much simpler.
         */
        switch (c) {

        case '0': case '1': case '2': case '3':
        case '4': case '5': case '6': case '7':
        case '8': case '9':
          flags &= ~(SIGNOK | NDIGITS);
          goto fok;

        case '+': case '-':
          if (flags & SIGNOK) {
            flags &= ~SIGNOK;
            goto fok;
          }
          break;
        case '.':
          if (flags & DPTOK) {
            flags &= ~(SIGNOK | DPTOK);
            goto fok;
          }
          break;
        case 'e': case 'E':
          /* no exponent without some digits */
          if ((flags&(NDIGITS|EXPOK)) == EXPOK) {
            flags =
                (flags & ~(EXPOK|DPTOK)) |
                SIGNOK | NDIGITS;
            goto fok;
          }
          break;
        }
        break;
    fok:
        *p++ = c;
        if (--fp->_r > 0)
          fp->_p++;
        else if (__srefill(fp))
          break;  /* EOF */
      }
      /*
       * If no digits, might be missing exponent digits
       * (just give back the exponent) or might be missing
       * regular digits, but had sign and/or decimal point.
       */
      if (flags & NDIGITS) {
        if (flags & EXPOK) {
          /* no digits at all */
          while (p > buf)
            ungetc(*(u_char *)--p, fp);
          goto match_failure;
        }
        /* just a bad exponent (e and maybe sign) */
        c = *(u_char *)--p;
        if (c != 'e' && c != 'E') {
          (void) ungetc(c, fp);/* sign */
          c = *(u_char *)--p;
        }
        (void) ungetc(c, fp);
      }
      if ((flags & SUPPRESS) == 0) {
        double res;

        *p = '\0';
        res = strtod(buf, (char **) NULL);
        if (flags & LONGDBL)
          *va_arg(ap, long double *) = res;
        else if (flags & LONG)
          *va_arg(ap, double *) = res;
        else
          *va_arg(ap, float *) = res;
        nassigned++;
      }
      nread += p - buf;
      break;
#endif /* FLOATING_POINT */
    }
  }
input_failure:
  return (nassigned ? nassigned : -1);
match_failure:
  return (nassigned);
}

#ifdef TINY_SSCANF
#else
/*
 * Fill in the given table from the scanset at the given format
 * (just after `[').  Return a pointer to the character past the
 * closing `]'.  The table has a 1 wherever characters should be
 * considered part of the scanset.
 */
static u_char *
__sccl(char *tab, u_char *fmt)
{
  int c, n, v;

  /* first `clear' the whole table */
  c = *fmt++;    /* first char hat => negated scanset */
  if (c == '^') {
    v = 1;    /* default => accept */
    c = *fmt++;  /* get new first char */
  } else
    v = 0;    /* default => reject */
  /* should probably use memset here */
  for (n = 0; n < 256; n++)
    tab[n] = v;
  if (c == 0)
    return (fmt - 1);/* format ended before closing ] */

