OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Utilities/misc/stm32_tiny_sscanf.c
  /*
   * Now set the entries corresponding to the actual scanset
   * to the opposite of the above.
   *
   * The first character may be ']' (or '-') without being special;
   * the last character may be '-'.
   */
  v = 1 - v;
  for (;;) {
    tab[c] = v;    /* take character c */
doswitch:
    n = *fmt++;    /* and examine the next */
    switch (n) {

    case 0:      /* format ended too soon */
      return (fmt - 1);

    case '-':
      /*
       * A scanset of the form
       *  [01+-]
       * is defined as `the digit 0, the digit 1,
       * the character +, the character -', but
       * the effect of a scanset such as
       *  [a-zA-Z0-9]
       * is implementation defined.  The V7 Unix
       * scanf treats `a-z' as `the letters a through
       * z', but treats `a-a' as `the letter a, the
       * character -, and the letter a'.
       *
       * For compatibility, the `-' is not considerd
       * to define a range if the character following
       * it is either a close bracket (required by ANSI)
       * or is not numerically greater than the character
       * we just stored in the table (c).
       */
      n = *fmt;
      if (n == ']' || n < c) {
        c = '-';
        break;  /* resume the for(;;) */
      }
      fmt++;
      do {    /* fill in the range */
        tab[++c] = v;
      } while (c < n);
#if 1  /* XXX another disgusting compatibility hack */
      /*
       * Alas, the V7 Unix scanf also treats formats
       * such as [a-c-e] as `the letters a through e'.
       * This too is permitted by the standard....
       */
      goto doswitch;
#else
      c = *fmt++;
      if (c == 0)
        return (fmt - 1);
      if (c == ']')
        return (fmt);
#endif
      break;

    case ']':    /* end of scanset */
      return (fmt);

    default:    /* just another character */
      c = n;
      break;
    }
  }
  /* NOTREACHED */
}
#endif

int
tiny_sscanf(const char *str, const char *fmt, ...)
{
  int ret;
  va_list ap;
  
  va_start(ap, fmt);
  ret = tiny_vfscanf(str, fmt, ap);
  va_end(ap);
  return (ret);
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
